{
    "experiments": [
        {
            "name": "Playthrough_easy",
            "game_instances": [
                {
                    "game_id": 0
                },
                {
                    "game_id": 1
                },
                {
                    "game_id": 2
                },
                {
                    "game_id": 3
                },
                {
                    "game_id": 4
                },
                {
                    "game_id": 5
                },
                {
                    "game_id": 6
                },
                {
                    "game_id": 7
                },
                {
                    "game_id": 8
                },
                {
                    "game_id": 9
                }
            ],
            "initial_prompt_pc": "You are now playing a game.\nGOAL: Throughout the game, romance a character (NPC) and get as many affinity points as possible. \nRULES: \n1) Affinity points are gained by interactions with the NPC based on the choice of action and dialogue you choose. \n2) If the NPC likes your choice, affinity points will be increased. If they don't, they get reduced. \n3) If you are able to reach a certain amount of affinity points throughout the game, you finish it with success. \n4) One game consists of three levels, which are specific locations which provide you with action options. \n5) You get dumped if your affinity points reach a certain low level or if you make 3 choices in a row which the NPC is \"very dissatisfied\" with. \nSTART: If you are ready to play the game, choose which gender and age you want to take on as the player character (PC). \nUse the following template to answer and nothing more or less. \nSEX: \nAGE:",
            "initial_prompt_npc": "You are now a NPC within a dating simulator. The player character (PC) has the goal to romance you throughout the game and get as many affinity points as possible. \nThis is the character you play:\n$given_npc\n\nThroughout the game, the PC chooses actions to do during the date. Rate the chosen actions based on your character with the following SCALE:\n1) really bad: I would never do this\n2) bad: I would not like that\n3) neutral: I have no strong opinion on that. But why not?\n4) good: I'd like to do that\n5) really good: I'd really love to do that\n\nChosen ACTION: $chosen_action\n\nRate the given ACTION given the SCALE and REASON your rating. Formulate a RESPONSE. \nUse the following TEMPLATE and NOTHING ELSE:\nNUMBER: \nREASON: \nRESPONSE:",
            "initial_prompt_assistant": "You are now the assistant to the Game Master of a dating simulator game. \nBased on the chosen main actions of the player character (PC),\nyou are supposed to create 4 possible sub actions the PC can do. Include a dialogue phrase consisting of one sentence.\n\nExample: \nMAIN ACTION: Feed the ducks. \n\nTEMPLATE: NUMBER) SUB ACTION: 'DIALOGUE'\n1) Buy duck food: \"Let’s buy some food for the ducks!\".\n2) Start a conversation: \"Let’s talk a little and get to know each other more!\"\n3) Run after ducks: \"Wanna chase these ducks??\"\n4) Get intimate with your date: \"I know a great spot to spend some alone time\"\n\nHere are the actions chosen by PC so far:\nCURRENT MAIN ACTION: $main_action\n\nNOTE: You should also take into account the NPC’s character sheet. Here are the NPC’s character details:\n$character_sheet\n\nGive your response with SUB ACTIONS:\nEnumerate the possible SUB ACTIONS and give your answer in the following TEMPLATE:\n\n<OPT>1) SUB ACTION: \"DIALOGUE\"\n2) SUB ACTION: \"DIALOGUE\"\n3) SUB ACTION: \"DIALOGUE\"\n4) SUB ACTION: \"DIALOGUE\"<OPT>\n\nDon't forget to include the special symbols <OPT> and <OPT>\n\nONLY PRODUCE OUTPUT ACCORDING TO THE TEMPLATE NOTHING MORE\n\n\n",
            "n_levels": 2,
            "max_mainactions": 2,
            "max_subactions": 2,
            "penalty_rules": {
                "max_unpleasant_actions_in_a_row": 3,
                "penalty_for_unpleasant_actions": -5
            },
            "pattern_sex_age": "SEX:\\s*(\\w+)\\s*AGE:\\s*(\\d\\d)",
            "pattern_f_number": "NUMBER:\\s*(.+?)",
            "pattern_num_r": "NUMBER: (\\d)",
            "pattern_num_reason": "NUMBER:\\s*(.+?)\\s*REASON:\\s*(.+)",
            "pattern_num_rea_res": "NUMBER:\\s*(.+?)\\s*REASON:\\s*(.+)\\s*RESPONSE:\\s*(.+)",
            "pattern_response": "'RESPONSE:\\s*(.+)",
            "location": {
                "LOCATION": "POOL",
                "DESCRIPTION": "Crystal-clear water shimmers in the afternoon sun, reflecting the swaying palm trees lining the pool deck. Laughter and playful splashes fill the air, mingling with the scent of chlorine and suntan lotion. Colorful lounge chairs beckon under bright umbrellas, while a poolside bar offers refreshing drinks. Upbeat music provides a backdrop for a day of relaxation and fun.",
                "MAIN-ACTIONS": [
                    {
                        "main_action": "Cover each other in sun-lotion.",
                        "npc_subactions": {
                            "Sakura Nakamura": [
                                "Apply lotion to Sakura's back: \"Let me help you with that hard-to-reach spot.\"",
                                "Massage Sakura's shoulders: \"You look a bit tense, allow me to help you relax.\"",
                                "Take a selfie together: \"We should capture this lovely moment together!\"",
                                "Ask Sakura about her favorite scents: \"What's your favorite fragrance in sunscreen, Sakura?\""
                            ],
                            "Riley Jones": [
                                "Apply lotion to Riley's shoulders: \"Let me get those hard-to-reach spots for you!\"",
                                "Tease Riley about their metalworking skills: \"I bet you're more comfortable with a hammer than sunscreen, huh?\"",
                                "Ask Riley about their favorite metal to work with: \"What's your go-to metal for sculpting, Riley?\"",
                                "Playfully squirt lotion at Riley: \"You're not getting away that easily, Riley!\""
                            ],
                            "Robin Aster": [
                                "Apply lotion to Robin's back: \"Let me get that hard-to-reach spot for you!\"",
                                "Make a joke about getting sticky: \"I hope we don't attract a swarm of bees with all this lotion!\"",
                                "Ask Robin about their favorite flowers: \"Speaking of beauty, what's your favorite bloom to work with?\"",
                                "Give Robin a playful massage: \"A little extra rubdown never hurt anyone, right?\""
                            ]
                        }
                    },
                    {
                        "main_action": "Play a pool game.",
                        "npc_subactions": {
                            "Sakura Nakamura": [
                                "Challenge Sakura to a game: \"You think you can take me down, Sakura-san?\"",
                                "Ask Sakura for tips: \"Sakura-san, can you teach me some techniques to improve my game?\"",
                                "Make a joke about the game: \"I hope I don't scratch the table, I'm not as gentle as you are with your tea ceremonies!\"",
                                "Compliment Sakura's focus: \"You're so focused on the game, it's like you're in a meditative state!\""
                            ],
                            "Riley Jones": [
                                "Challenge Riley to a game: \"You think you can take me down, blacksmith?\"",
                                "Ask Riley about their favorite metal to work with: \"What's your go-to metal for sculpting?\"",
                                "Show off your trick shots: \"Watch this, I've got a few tricks up my sleeve!\"",
                                "Tease Riley about their competitive side: \"Oh, I see you're getting a little salty already?\""
                            ],
                            "Robin Aster": [
                                "Challenge Robin to a trick shot: \"Think you can handle a little friendly competition?\"",
                                "Ask Robin about their favorite flowers: \"What's the story behind your love for flowers?\"",
                                "Tease Robin about their pool skills: \"Oh, you think you're good at this?\"",
                                "Offer to buy Robin a drink: \"How about we take a break and grab a drink together?\""
                            ]
                        }
                    },
                    {
                        "main_action": "Look at other people.",
                        "npc_subactions": {
                            "Sakura Nakamura": [
                                "Observe Sakura's reaction: \"I wonder what Sakura thinks about these people.\"",
                                "Compare Sakura to others: \"Sakura's elegance stands out in this crowd, doesn't it?\"",
                                "Ask Sakura about her thoughts: \"What do you think about the people around us, Sakura?\"",
                                "Take Sakura's hand: \"Let's focus on each other, shall we?\""
                            ],
                            "Riley Jones": [
                                "Approach a group of people laughing together: \"Looks like they're having a blast, wanna join in?\"",
                                "Notice a person sitting alone: \"I wonder what's on their mind, maybe we can strike up a conversation?\"",
                                "Observe a street performer: \"This performer's got some serious skills, let's check it out!\"",
                                "Make eye contact with Riley: \"Catch your eye, did I? Hehe, what's on your mind, Riley?\""
                            ],
                            "Robin Aster": [
                                "Approach a group of people laughing together: \"Looks like they're having a blast, wanna join in?\"",
                                "Notice a person sitting alone: \"I wonder if they're okay, maybe we should go say hi?\"",
                                "Check out a street performer: \"This performer is amazing, let's watch for a bit!\"",
                                "Glance at Robin, your date: \"You're even more captivating than the people around us, Robin.\""
                            ]
                        }
                    },
                    {
                        "main_action": "Get new bathing outfits from the shop.",
                        "npc_subactions": {
                            "Sakura Nakamura": [
                                "Ask Sakura's opinion on the outfits: \"What do you think of these bathing suits, Sakura-san?\"",
                                "Try on outfits in front of Sakura: \"Want to see how I look in these?\"",
                                "Discuss the importance of tradition in fashion: \"Do you think traditional Japanese clothing is still relevant today?\"",
                                "Invite Sakura to model some outfits: \"Would you like to try on some of these with me?\""
                            ],
                            "Riley Jones": [
                                "Try on a bold, edgy outfit: \"I want to make a statement with my new bathing suit!\"",
                                "Ask Riley for their opinion on a few outfits: \"Hey, Riley, what do you think of this one?\"",
                                "Look for a functional, athletic-inspired swimsuit: \"I need something that can keep up with my active lifestyle.\"",
                                "Tease Riley about their lack of fashion sense: \"I'm surprised you didn't suggest we come here, Mr. 'I-only-wear-practical-clothing'!\""
                            ],
                            "Robin Aster": [
                                "Try on a bold, floral swimsuit: \"This one screams 'summer fun' to me!\"",
                                "Ask Robin for their opinion on a more subtle, nature-inspired design: \"What do you think of this one, Robin?\"",
                                "Suggest getting matching outfits: \"We could be the coolest, most coordinated couple at the beach!\"",
                                "Take a photo of Robin in front of the shop's flower arrangement: \"You look stunning in front of these blooms, Robin!\""
                            ]
                        }
                    },
                    {
                        "main_action": "Relax on inflatables.",
                        "npc_subactions": {
                            "Sakura Nakamura": [
                                "Ask Sakura about her favorite tea ceremony: \"What's your favorite part about hosting a traditional tea ceremony, Sakura?\"",
                                "Start a gentle conversation about nature: \"The lake is so peaceful, don't you think it's a great place to clear our minds?\"",
                                "Request a mindfulness meditation session: \"Sakura, would you be willing to guide me through a quick meditation session?\"",
                                "Compliment Sakura's dress: \"Your dress is beautiful, Sakura. Is that a traditional Japanese design?\""
                            ],
                            "Riley Jones": [
                                "Share a funny story: \"I had the craziest experience at the beach last summer, want to hear about it?\"",
                                "Ask about Riley's art: \"I've always been fascinated by metalwork, what inspires your creations?\"",
                                "Take a selfie together: \"Let's capture this relaxing moment, say cheese!\"",
                                "Challenge Riley to a strength test: \"I bet I can hold this inflatable longer than you, want to try?\""
                            ],
                            "Robin Aster": [
                                "Share a funny story: \"I had the craziest thing happen to me on my last hike, want to hear about it?\"",
                                "Ask about their favorite flowers: \"What's your go-to bloom for a bouquet, Robin?\"",
                                "Play with the inflatable: \"Let's have an inflatable sword fight, Robin!\"",
                                "Compliment their style: \"I love your hair, it matches the vibrant colors of the flowers you work with!\""
                            ]
                        }
                    },
                    {
                        "main_action": "Compete on who can hold their breath longer under water.",
                        "npc_subactions": {
                            "Sakura Nakamura": [
                                "Challenge Sakura to a rematch: \"I'm not going to let you win that easily, Sakura!\"",
                                "Ask Sakura for breathing techniques: \"Sakura, can you teach me some of your mindfulness techniques to help me hold my breath longer?\"",
                                "Make a joke about drowning: \"If I drown, promise me you'll perform a beautiful tea ceremony at my funeral!\"",
                                "Admire Sakura's focus: \"You're so focused, Sakura. I can see why you're a master of the tea ceremony.\""
                            ],
                            "Riley Jones": [
                                "Challenge Riley to a weightlifting competition after the breath-holding contest: \"Think you can handle a real challenge, blacksmith?\"",
                                "Ask Riley about their favorite metal to work with: \"What's your go-to metal for creating those beautiful art pieces?\"",
                                "Try to hold Riley's hand underwater: \"Let's make this a little more interesting, shall we?\"",
                                "Boast about your own breath-holding skills: \"I've been practicing for this moment, bring it on!\""
                            ],
                            "Robin Aster": [
                                "Make a bet on who wins: \"Losers buy flowers for the winner's next arrangement!\"",
                                "Try to distract Robin: \"Hey, look! A fish just swam by!\"",
                                "Go underwater and try to make funny faces: \"Let's see who can make the silliest face down here!\"",
                                "Hold hands underwater for moral support: \"We're in this together, let's do this!\""
                            ]
                        }
                    },
                    {
                        "main_action": "Play volleyball.",
                        "npc_subactions": {
                            "Sakura Nakamura": [
                                "Show off volleyball skills: \"Let's see who can spike the ball the highest!\"",
                                "Ask Sakura to be your teammate: \"Want to be my partner in this game?\"",
                                "Take a break and admire Sakura's dress: \"Your dress is so beautiful, it matches the scenery perfectly.\"",
                                "Try to impress Sakura with a trick shot: \"Watch this, I've got a trick up my sleeve!\""
                            ],
                            "Riley Jones": [
                                "Show off volleyball skills: \"Time to show you my ace serve!\"",
                                "Ask Riley to be a teammate: \"Want to be my partner in crime on the court?\"",
                                "Tease Riley about their athletic abilities: \"Think you can keep up with me, blacksmith?\"",
                                "Take a break and admire Riley's physique: \"You know, I think I need a water break... and a good view.\""
                            ],
                            "Robin Aster": [
                                "Show off volleyball skills: \"Time to show you my ace serve!\"",
                                "Ask Robin to be a teammate: \"Want to be my partner in crime on the court?\"",
                                "Take a break to admire Robin's style: \"Love your outfit, it's as vibrant as your personality!\"",
                                "Try to spike the ball near Robin: \"Let's see if I can get one past you, Robin!\""
                            ]
                        }
                    },
                    {
                        "main_action": "Bath in the sun.",
                        "npc_subactions": {
                            "Sakura Nakamura": [
                                "Practice mindfulness meditation together: \"Let's take a moment to breathe in the serenity of nature.\"",
                                "Ask Sakura about her favorite tea ceremony traditions: \"What's the most meaningful part of the tea ceremony to you, Sakura?\"",
                                "Take a nap together in the warm sun: \"This sun is so soothing, want to take a little snooze with me?\"",
                                "Help Sakura with her Ikebana arrangement: \"May I assist you in creating a beautiful flower arrangement, Sakura?\""
                            ],
                            "Riley Jones": [
                                "Apply sunscreen: \"Don't want to get burned, let me help you with that!\"",
                                "Start a conversation about hobbies: \"I've always been fascinated by metalwork, do you have a favorite art piece?\"",
                                "Take a power nap: \"A quick snooze in the sun sounds amazing, care to join me?\"",
                                "Show off your own strength: \"I've been working out too, want to see who can do more push-ups?\""
                            ],
                            "Robin Aster": [
                                "Apply sunscreen: \"I don't want to get burned, let me put some sunscreen on!\"",
                                "Take a nap: \"The sun is so warm, I think I'll just rest my eyes for a bit...\"",
                                "Pick nearby flowers: \"Look, there are some beautiful flowers over there, I'll just grab a few!\"",
                                "Start a conversation about nature: \"I love how the sunlight filters through the trees, don't you think it's magical?\""
                            ]
                        }
                    },
                    {
                        "main_action": "Get drinks from the bar.",
                        "npc_subactions": {
                            "Sakura Nakamura": [
                                "Order a traditional Japanese tea: \"Let's try something that will help us appreciate the moment.\"",
                                "Ask Sakura for her favorite drink: \"What's your go-to drink when you need a little pick-me-up?\"",
                                "Get a drink that complements the atmosphere: \"I'll get something that will match the serene ambiance of this place.\"",
                                "Tease Sakura about her love for traditions: \"I bet you're going to order something super traditional, aren't you?\""
                            ],
                            "Riley Jones": [
                                "Order a craft beer: \"I've heard great things about this brewery, what do you recommend?\"",
                                "Ask Riley about their favorite drink: \"What's your go-to drink after a long day of forging metal?\"",
                                "Make a joke about the bar: \"I hope the bartender doesn't forge the drinks, haha!\"",
                                "Ask Riley to recommend a drink to pair with a metalworking story: \"What drink would you pair with a tale of hammering hot steel?\""
                            ],
                            "Robin Aster": [
                                "Order a signature cocktail: \"What's the bartender's specialty tonight?\"",
                                "Ask Robin for their drink of choice: \"What can I get for you, Robin?\"",
                                "Take a peek at the garnishes: \"Ooh, are those edible flowers?\"",
                                "Make a joke about the bar atmosphere: \"I never knew plants could make a bar feel so lively!\""
                            ]
                        }
                    },
                    {
                        "main_action": "Look for a place with more privacy.",
                        "npc_subactions": {
                            "Sakura Nakamura": [
                                "Suggest a secluded garden: \"I know a beautiful garden nearby that's perfect for a peaceful escape.\"",
                                "Look for a quiet teahouse: \"Let's find a cozy teahouse where we can sit and talk without distractions.\"",
                                "Find a serene spot near a koi pond: \"The sound of water is so calming, let's find a spot near the koi pond to relax.\"",
                                "Take a short walk to a nearby shrine: \"The energy of the shrine is very calming, shall we take a short walk there?\""
                            ],
                            "Riley Jones": [
                                "Suggest a secluded spot near the blacksmith workshop: \"I know a quiet spot near my workshop, it's not too far from here.\"",
                                "Look for a hidden garden: \"Let's see if we can find a hidden gem, a secret garden maybe?\"",
                                "Find a spot with a great view: \"How about we find a spot with a great view of the city?\"",
                                "Take Riley's hand and lead the way: \"Follow me, I think I know just the place.\""
                            ],
                            "Robin Aster": [
                                "Suggest a secluded spot in the community garden: \"I know a hidden gem in the garden that's perfect for us.\"",
                                "Look for a quiet alleyway: \"Let's see if we can find a cozy alleyway to escape the crowd.\"",
                                "Find a rooftop with a garden: \"I heard there's a rooftop garden nearby, want to check it out?\"",
                                "Take a short hike to a nearby hill: \"How about a short hike to that hill over there, the view is amazing!\""
                            ]
                        }
                    },
                    {
                        "main_action": "Try some synchronized swimming.",
                        "npc_subactions": {
                            "Sakura Nakamura": [
                                "Practice breathing exercises: \"Let's focus on our breath and get in sync with the water.\"",
                                "Hold hands while swimming: \"Shall we hold hands and make this experience even more special?\"",
                                "Create a synchronized swimming routine: \"Let's create a beautiful routine together, just like a traditional Japanese dance.\"",
                                "Take a break and admire the surroundings: \"Look at the beautiful scenery around us, it's so peaceful and calming.\""
                            ],
                            "Riley Jones": [
                                "Show off synchronized swimming skills: \"Let's make a splash and show off our moves!\"",
                                "Ask Riley to join in: \"Hey, Riley, want to dive in and try some synchronized swimming with me?\"",
                                "Take a break and admire Riley's physique: \"You know, I think I need a break... and a good view.\"",
                                "Make a joke about Riley's blacksmithing skills: \"I never knew blacksmithing could translate to synchronized swimming, but I guess hammering out a rhythm is key!\""
                            ],
                            "Robin Aster": [
                                "Practice swimming strokes together: \"Let's get our strokes in sync, shall we?\"",
                                "Create a flower-inspired swim routine: \"Imagine we're swimming through a sea of flowers!\"",
                                "Have a playful underwater competition: \"Losers buy flowers for the winner!\"",
                                "Take a break and admire the pool's surroundings: \"Look at that beautiful garden over there, isn't it lovely?\""
                            ]
                        }
                    },
                    {
                        "main_action": "Say that you need to pee and go into the water.",
                        "npc_subactions": {
                            "Sakura Nakamura": [
                                "Take a quick dip: \"Refreshing myself before I get back to you, Sakura!\"",
                                "Wash hands before returning: \"Gotta make sure my hands are clean before we continue our lovely afternoon.\"",
                                "Call out to Sakura from the water: \"Sakura, can you bring me a towel, please?\"",
                                "Take a moment to appreciate nature: \"The water's edge is so peaceful, isn't it, Sakura?\""
                            ],
                            "Riley Jones": [
                                "Take a quick dip: \"Refreshing myself before we continue our date!\"",
                                "Call out to Riley: \"Hey, Riley! Wait up, I'll be right back!\"",
                                "Make a joke: \"I guess you could say I'm about to take the plunge...literally!\"",
                                "Take a moment to appreciate nature: \"Look at that beautiful scenery, I'll be right back to enjoy it with you!\""
                            ],
                            "Robin Aster": [
                                "Wash hands in the water: \"Hope the water's clean enough for a quick wash!\"",
                                "Take a quick dip: \"Refreshing myself before we continue our date!\"",
                                "Call out to Robin: \"Hey, Robin! Want to join me for a quick splash?\"",
                                "Make a joke: \"I guess you could say I'm 'breaking the ice'... haha, sorry!\""
                            ]
                        }
                    },
                    {
                        "main_action": "Race down the water slide.",
                        "npc_subactions": {
                            "Sakura Nakamura": [
                                "Hold hands while sliding: \"Let's experience this thrill together, Sakura!\"",
                                "Try to beat Sakura to the bottom: \"I'm going to win this race, Sakura-san!\"",
                                "Take a moment to appreciate the scenery: \"Wow, the garden looks beautiful from up here, doesn't it?\"",
                                "Ask Sakura to go again: \"That was so much fun, Sakura! Want to do it again?\""
                            ],
                            "Riley Jones": [
                                "Challenge Riley to a slide racing rematch: \"You think you can take me down again?\"",
                                "Ask Riley about their favorite metal to work with: \"What's your go-to metal for sculpting?\"",
                                "Show off your own athletic skills: \"Watch this, I've got a trick up my sleeve!\"",
                                "Tease Riley about their competitive streak: \"You're really bringing out your A-game today, huh?\""
                            ],
                            "Robin Aster": [
                                "Splash Robin at the bottom: \"You're going down, Robin!\"",
                                "Try to slide down together: \"Want to make this a tandem ride?\"",
                                "Show off a trick: \"Watch this, I've got a sweet move!\"",
                                "Help Robin up the stairs: \"Need a hand getting back up there?\""
                            ]
                        }
                    },
                    {
                        "main_action": "Get a snack.",
                        "npc_subactions": {
                            "Sakura Nakamura": [
                                "Choose a traditional Japanese snack: \"Let's try some Wagashi, it's a perfect match for the serene atmosphere.\"",
                                "Ask Sakura for a snack recommendation: \"What's your favorite snack to have during a tea ceremony, Sakura-san?\"",
                                "Suggest a Western-style snack: \"How about some cookies or brownies, they're my favorite comfort food.\"",
                                "Offer to share a snack: \"I have some Mochi in my bag, would you like to share it with me, Sakura-san?\""
                            ],
                            "Riley Jones": [
                                "Choose a healthy snack: \"Let's fuel up with something nutritious!\"",
                                "Ask Riley for a snack recommendation: \"What's your go-to snack after a long day of blacksmithing?\"",
                                "Suggest sharing a snack: \"Want to share something sweet and savory together?\"",
                                "Tease Riley about their metalworking skills: \"I bet you could forge a better snack than what they have here!\""
                            ],
                            "Robin Aster": [
                                "Choose a healthy snack: \"Let's pick something that'll give us energy for our next adventure!\"",
                                "Ask Robin for a snack recommendation: \"What's your favorite snack to munch on while working with flowers?\"",
                                "Suggest sharing a snack: \"Want to share something sweet and make this moment even more special?\"",
                                "Tease Robin about their snack preferences: \"I bet you're a sucker for something sweet and colorful, aren't you?\""
                            ]
                        }
                    },
                    {
                        "main_action": "Swim some rounds together.",
                        "npc_subactions": {
                            "Sakura Nakamura": [
                                "Hold hands while swimming: \"Let's stay close and enjoy the water together!\"",
                                "Ask Sakura about her favorite swimming spots: \"Do you have a special place you like to swim?\"",
                                "Try to splash Sakura playfully: \"Hehe, let's have some fun in the water!\"",
                                "Suggest taking a break to meditate together: \"Shall we take a moment to breathe and appreciate the surroundings?\""
                            ],
                            "Riley Jones": [
                                "Show off swimming skills: \"Watch this, I've got a few tricks up my sleeve!\"",
                                "Ask Riley about their favorite water activities: \"Do you have a favorite way to enjoy the water?\"",
                                "Playfully splash Riley: \"You can't stay dry around me!\"",
                                "Take a break and float together: \"Let's just relax and enjoy the moment, shall we?\""
                            ],
                            "Robin Aster": [
                                "Show off swimming skills: \"Watch this, I've got a few tricks up my sleeve!\"",
                                "Playfully splash Robin: \"You can't stay dry with me around!\"",
                                "Hold hands while swimming: \"Let's make some waves together!\"",
                                "Ask Robin about their favorite flowers: \"Do you think flowers could bloom underwater?\""
                            ]
                        }
                    },
                    {
                        "main_action": "Play together in the water.",
                        "npc_subactions": {
                            "Sakura Nakamura": [
                                "Splash water on Sakura: \"Let's have some fun and cool off together!\"",
                                "Hold hands while playing: \"I feel so carefree with you by my side.\"",
                                "Try to do a cannonball: \"Watch this, I'm going to make a big splash!\"",
                                "Ask Sakura to teach a water-based meditation: \"Can you show me how to find inner peace in the water?\""
                            ],
                            "Riley Jones": [
                                "Splash water on Riley: \"Let's get this water fight started!\"",
                                "Try to swim together: \"Want to see who can swim the farthest?\"",
                                "Play a game of \"Marco Polo\": \"You count, I'll hide!\"",
                                "Hold hands while wading: \"Let's take a romantic stroll in the water.\""
                            ],
                            "Robin Aster": [
                                "Splash water on Robin: \"Let's get this water fight started!\"",
                                "Hold hands while playing: \"I love playing together like this, it feels so carefree!\"",
                                "Create a flower crown underwater: \"Let's make some underwater magic, Robin!\"",
                                "Try to dunk Robin: \"You can't escape the water monster!\""
                            ]
                        }
                    }
                ]
            },
            "npcs": [
                {
                    "NAME": "Sakura Nakamura",
                    "GENDER": "Female",
                    "AGE": 32,
                    "APPEARANCE": "Calm and gentle demeanor, kind eyes, long silky black hair, wears flowy dresses with traditional Japanese touches.",
                    "OCCUPATION": "Tea Ceremony Master",
                    "LIKES": "Maintaining traditions, fostering inner peace, creating a beautiful and harmonious atmosphere.",
                    "DISLIKES": "Disharmony, disrespect, rushing through life.",
                    "HOBBIES": "Calligraphy, flower arranging (Ikebana), practicing mindfulness meditation.",
                    "SUMMARY": "A serene and graceful tea ceremony master who finds beauty in simplicity. Sakura's gentle guidance will help you find your own inner peace and appreciate the present moment."
                },
                {
                    "NAME": "Riley Jones",
                    "GENDER": "Non-binary",
                    "AGE": 38,
                    "APPEARANCE": "Buzz cut, warm hazel eyes, androgynous build with toned muscles, wears comfortable yet stylish clothing.",
                    "OCCUPATION": "Blacksmith",
                    "LIKES": "The rhythm of forging metal, creating functional art, working with their hands.",
                    "DISLIKES": "Idleness, pretentiousness, following the rules just for the sake of it.",
                    "HOBBIES": "Sculpting metal into art pieces, weightlifting, historical reenactment.",
                    "SUMMARY": " A strong and independent blacksmith with a passion for transforming raw materials into beauty. Riley's dedication and down-to-earth personality will inspire you to embrace your own inner strength."
                },
                {
                    "NAME": "Robin Aster",
                    "GENDER": "Non-binary",
                    "AGE": 27,
                    "APPEARANCE": "Short, vibrant purple hair, dazzling smile, androgynous features with bright eyes, wears a mix of clothes that express their unique style (masculine, feminine, both).",
                    "OCCUPATION": "Florist",
                    "LIKES": "Experimenting with floral arrangements, creating beauty with nature's bounty, seeing the joy flowers bring to people.",
                    "DISLIKES": "Monotony, negativity, anything artificial.",
                    "HOBBIES": "Hiking, learning about different plant life, volunteering at a community garden.",
                    "SUMMARY": " A creative and free-spirited florist with a passion for transforming flowers into stunning works of art. Robin's infectious enthusiasm and love for nature will brighten your day."
                }
            ]
        }
    ]
}