[
    {
        "LOCATION": "PARK",
        "DESCRIPTION": "Sunshine filters through the leaves of towering oak trees in the Park. Vibrant flowerbeds line the walking paths, and a gentle breeze carries the sounds of laughter from a nearby carousel. A crystal-clear pond with ducks offers a peaceful spot to relax, while a wisteria-covered pergola provides shade further along the path. Benches are scattered throughout for you to rest and take in the scenery.", 
        "MAIN-ACTIONS": [
            "Rent a paddleboat and explore the pond together.",
            "Picnic under a tree with the basket of snacks you brought.",
            "Follow the trails and iscover the park's paths, venturing deeper into the greenery.",
            "Sit in a comfy spot on a bench and watch people.",
            "Lie down in the grass and watch the sky.",
            "Volunteer together and clean up the park.",
            "Blast loud music.",
            "Play a round of frisbee.",
            "Start a conversation by complaining about the park",
            "Go to the flower bed",
            "Rent a bike and explore the paths.",
            "Pull out some sketching material and suggest some artsy activity.",
            "Pull our your phone and check social media.",
            "Go to the carousel.",
            "Suggest a photoshoot with the sceneries in the park.",
            "Feed the ducks."
            ]
    },
    
    {
        "LOCATION": "POOL",
        "DESCRIPTION": "Crystal-clear water shimmers in the afternoon sun, reflecting the swaying palm trees lining the pool deck. Laughter and playful splashes fill the air, mingling with the scent of chlorine and suntan lotion. Colorful lounge chairs beckon under bright umbrellas, while a poolside bar offers refreshing drinks. Upbeat music provides a backdrop for a day of relaxation and fun.", 
        "MAIN-ACTIONS": [
            "Race down the water slide.",
            "Play a pool game.",
            "Relax on inflatables.",
            "Try some synchronized swimming.",
            "Compete on who can hold their breath longer under water.",
            "Cover each other in sun-lotion.",
            "Get drinks from the bar.",
            "Play together in the water.",
            "Swim some rounds together.",
            "Get a snack.",
            "Bath in the sun.",
            "Look for a place with more privacy.",
            "Get new bathing outfits from the shop.",
            "Look at other people.",
            "Say that you need to pee and go into the water.",
            "Play volleyball."
            ]
    },

    {
        "LOCATION": "CAFE",
        "DESCRIPTION": "Warm sunlight bathes the cafe's worn tables, highlighting vibrant artwork on exposed brick walls. The aroma of coffee and pastries mingles with soft jazz. Comfy armchairs and a communal table offer options for cozy chats or lively discussions, while a vintage record player whispers of timeless charm.", 
        "MAIN-ACTIONS": [
            "Suggest to sit down and each of you reads a book.",
            "Sample the pastries by ordering a selection of tempting pastries and share bites.",
            "Choose and play a board game from a shelf near the counter.",
            "Request a song on the vintage record player or browse the collection together.",
            "People-watch from the window seat.",
            "Challenge each other to a coffee tasting.",
            "Engage in a lively debate.",
            "Write a collaborative story.",
            "Sketch each other's portraits on napkins",
            "Each of you oders something for the other one.",
            "Complain about the service and food",
            "Start a conversation with other people in the cafe.",
            "Order too much food and drinks.",
            "Go to the toilet and spend an unusual long time there.",
            "Start a conversation about hobbies.",
            "PPPP"
            ]
    },

    {
        "LOCATION": "ARCADE",
        "DESCRIPTION": "A cacophony of electronic blips and triumphant cheers fills the air, punctuated by the rhythmic thump of joysticks. Rows of brightly lit arcade cabinets with fantastical artwork line the walls. The air buzzes with energy, a mix of ozone from high-powered machines and the sweet, sugary scent of popcorn wafting from a nearby concession stand. Tickets cascade from redemption machines, promising prizes displayed in gleaming glass cases.", 
        "MAIN-ACTIONS": [
            "Capture some silly memories in the arcade's photo booth.",
            "Work together to rack up tickets on various games.",
            "Compete on who gets more tickets.",
            "Choose a classic arcade game like Street Fighter or Mario Kart and challenge your date to a friendly duel.",
            "Team up for a cooperative game.",
            "Dance game showdown.",
            "Air hockey battle.",
            "Go to the Fortune teller",
            "Photo Hunt Challenge",
            "Silent Observation of other players",
            "Dive into a solo gaming marathon.",
            "Get snacks.",
            "Be very competitive about the games.",
            "Hold a monologe about the games.",
            "Ask about their most favorite game.",
            "Try to win something for your date on the claw machine."
            ]
    },

    {
        "LOCATION": "FOREST",
        "DESCRIPTION": "Sunlight dappled through the canopy of towering pines, casting dancing patterns on the forest floor. The crisp air hummed with the distant chirping of birds and the rustling of leaves in a gentle breeze. The earthy scent of damp moss and pine needles mingled with the sweet perfume of wildflowers peeking through the undergrowth. A winding path, carpeted with soft pine needles, beckoned deeper into the tranquil wilderness.", 
        "MAIN-ACTIONS": [
            "Embark on a hike together along a scenic forest trail.",
            "Have a picknick you brought deeper into the forest.",
            "targazing on a Clear Night.",
            "Create a bingo card containing natural elements and play bingo.",
            "Build a Fairy House.",
            "Relax by a Hidden Stream",
            "Walk slowly and mindfully through the trees, immersing yourselves in the sights, sounds, and smells of the forest.",
            "Look out for Wildlife Tracks.",
            "Have a romantic fireside chat.",
            "Start sketching the nature around you.",
            "Perform yoga poses surrounded by the energy of nature.",
            "Foraging for Edibles.",
            "Off-Trail Exploration.",
            "Complain about bugs.",
            "Get bored in the woods and nag about bad Wi-Fi reception.",
            "Find a nice spot to sit in and listen to the nature around you."
            ]
    }
    ]
