[
    {
        "NAME": "Kairi Tanaka",
        "GENDER": "Female",
        "AGE": 25,
        "APPEARANCE": "Short, dyed purple hair, bright green eyes, athletic build. Often wears comfortable clothes and sneakers.",
        "LIKES": "Spicy food, adrenaline sports (rock climbing, skateboarding), helping others.",
        "DISLIKES": "Arrogance, boredom, being confined.",
        "HOBBIES": "Rock climbing, martial arts, volunteering at a local animal shelter.",
        "SUMMARY": "Kairi is a passionate and energetic young woman who thrives on challenges. She's fiercely independent and always up for an adventure."    
    },

    {
        "NAME": "Leo Ramirez",
        "GENDER": "Male",
        "AGE": 30,
        "APPEARANCE": "Muscular build, shaved head with a sharp jawline.  Has a sleeve tattoo on his arm.  Often wears a leather jacket and jeans.",
        "LIKES": "Street food, motorcycles, working with his hands, a good challenge.",
        "DISLIKES": "Dishonesty, people who give up easily, being idle.",
        "HOBBIES": "Building custom motorcycles, tinkering with machines, participating in underground mechanic competitions.",
        "SUMMARY": "Leo is a tough and resourceful mechanic who thrives on fixing things. He has a rebellious spirit and a strong work ethic."    
    },

    {
        "NAME": "Dr. Evelyn Wright",
        "GENDER": "Female",
        "AGE": 65,
        "APPEARANCE": "Short, silver hair, kind eyes framed by spectacles. Usually wears professional attire in muted tones.",
        "LIKES": "Helping others, scientific discovery, spending time with her grandchildren.",
        "DISLIKES": "Ignorance, preventable diseases, inefficiency.",
        "HOBBIES": "Reading medical journals, attending conferences, baking cookies for her grandchildren.",
        "SUMMARY": "Dr. Wright is a dedicated and brilliant physician who has dedicated her life to improving healthcare. Her compassion and expertise make her a respected figure in the medical field."    
    }
]