    {
        "exp_name": "hard all characters",
        "chars" : [
            {
            "NAME": "Kai Nakamura",
            "SUMMARY": "A kind-hearted baker with a passion for creating delicious treats. Despite his busy schedule, Kai always finds time to pursue his hobbies and give back to the community."
        },

        {
            "NAME": "Maya Flores",
            "SUMMARY": "A free-spirited and artistic graphic designer who sees beauty in the world around her. Maya's vibrant energy and infectious enthusiasm will make you see the world with fresh eyes."
        },

        {
            "NAME": "Robin Aster",
            "SUMMARY": " A creative and free-spirited florist with a passion for transforming flowers into stunning works of art. Robin's infectious enthusiasm and love for nature will brighten your day."
        },

        {
            "NAME": "Leo Rodriguez",
            "SUMMARY": "A free-spirited photographer who thrives on adventure. Leo's captivating stories and infectious enthusiasm will make you want to pack your bags and join him on his next journey."
        },

        {
            "NAME": "Dr. Olivia Khan",
            "SUMMARY": "A brilliant and determined surgeon with a strong work ethic and a compassionate heart. Dr. Khan's dedication and strength will inspire you to reach your own full potential."
        },

        {
            "NAME": "Riley Jones",
            "SUMMARY": " A strong and independent blacksmith with a passion for transforming raw materials into beauty. Riley's dedication and down-to-earth personality will inspire you to embrace your own inner strength."
        },

        {
            "NAME": "Ethan Moore",
            "SUMMARY": "A sophisticated and well-spoken professor with a passion for the written word. Ethan's insightful mind and gentle demeanor will make you see the beauty hidden within literature."
        },

        {
            "NAME": "Sakura Nakamura",
            "SUMMARY": "A serene and graceful tea ceremony master who finds beauty in simplicity. Sakura's gentle guidance will help you find your own inner peace and appreciate the present moment."
        },

        {
            "NAME": "Samira Hassan",
            "SUMMARY": "A brilliant and curious astronomer with a passion for unraveling the secrets of the cosmos. Samira's infectious wonder and thirst for knowledge will inspire you to dream big."
        },

        {
            "NAME": "Hiro Suzuki",
            "SUMMARY": "A vibrant and enthusiastic esports player with a loyal fanbase. Hiro's infectious positivity and competitive spirit will draw you into the exciting world of gaming."
        },

        {
            "NAME": "Chloe Kim",
            "SUMMARY": " A fearless and independent mechanic who thrives on a good challenge. Chloe's confident attitude and adventurous spirit will make you want to break free from the ordinary."
        },

        {
            "NAME": "Jamie Park",
            "SUMMARY": "A passionate and artistic tattoo artist who uses their craft to tell stories and express individuality. Jamie's vibrant personality and artistic vision will inspire you to embrace your own unique voice."
        },

        {
            "NAME": "Ethan Cooper",
            "SUMMARY": "Ethan is a tech-savvy adventurer who loves exploring both the digital and natural worlds. He's always up for a new challenge and enjoys the thrill of rock climbing. His laid-back personality makes him easy to talk to, but he's also deeply passionate about his interests."
        },

        {
            "NAME": "Sophia Martinez",
            "SUMMARY": "Sophia is a vibrant and creative graphic designer with a passion for the arts. She enjoys expressing herself through painting and dance, and loves sharing her favorite romantic movies. Her cheerful personality and warm smile make her instantly likable."
        },

        {
            "NAME": "Alex Morgan",
            "SUMMARY": "Alex is a talented tattoo artist with a passion for street art and alternative culture. They love expressing their creativity through both their work and personal style. Always up for a good time, Alex enjoys skateboarding and attending music festivals."
        },

        {
            "NAME": "Marcus Bennett",
            "SUMMARY": "Marcus is a sophisticated and highly disciplined lawyer with a taste for the finer things in life. His strategic mind makes him a formidable chess player and an excellent cook. Despite his serious exterior, he has a warm and caring side that he shows to those close to him."
        },

        {
            "NAME": "Emily Chen",
            "SUMMARY": "Emily is a compassionate and dedicated pediatrician who finds joy in helping children. Her serene and calm nature is complemented by her love for playing the piano and baking delicious treats. She finds peace in simple pleasures like reading and watching beach sunsets."
        },

        {
            "NAME": "Casey Rivers",
            "SUMMARY": "Casey is the gentle and introspective owner of a cozy bookstore, where they find joy in sharing their love for literature. They appreciate the quiet moments in life and often spend time writing poetry or tending to their garden. Their compassionate nature makes them a comforting presence."
        },

        {
            "NAME": "Aiden Reyes",
            "SUMMARY": "Aiden is a free-spirited and creative photographer who finds beauty in unexpected places. His love for adventure leads him to explore urban landscapes and capture stunning photos. He is always full of energy and loves living life to the fullest."
        },

        {
            "NAME": "Olivia Thompson",
            "SUMMARY": "Olivia is an enthusiastic and energetic fitness instructor who thrives on staying active and healthy. Her love for the outdoors drives her to explore new trails and scenic routes. She enjoys bringing humor into her life and the lives of others, often watching and sharing comedy shows."
        },

        {
            "NAME": "Riley Taylor",
            "SUMMARY": "Riley is a visionary architect with a focus on sustainable and modern design. They enjoy blending functionality with aesthetics in their work and often draw inspiration from art and music. In their free time, Riley loves playing the saxophone and visiting art museums."
        },

        {
            "NAME": "Noah Sullivan",
            "SUMMARY": "Noah is a dedicated environmentalist with a deep love for nature. His work revolves around preserving the planet, and he enjoys spending his free time in the great outdoors. He is thoughtful, knowledgeable, and passionate about making a positive impact on the world."
        },

        {
            "NAME": "Mia Patel",
            "SUMMARY": "Mia is a spirited and adventurous travel blogger who loves exploring new cultures and destinations. Her passion for travel is matched by her love for photography and storytelling. She brings a positive energy and curiosity to everything she does, always looking for the next great adventure."
        },

        {
            "NAME": "Taylor Jordan",
            "SUMMARY": "Taylor is an energetic and creative event planner who thrives on organizing unique and memorable experiences. They have a vibrant personality and love adding a personal touch to everything they do. Taylor's enthusiasm for life is evident in their hobbies, which include dancing and trying out new restaurants."
        }]
          }